# -*- coding: utf-8 -*-

# Вывести на консоль жителей комнат (модули room_1 и room_2)
# Формат: В комнате room_1 живут: ...

# TODO здесь ваш код
from room_1 import folks as folks_room1
from room_2 import folks as folks_room2

print('В комнате 1 живут:', folks_room1)
print('В комнтае 2 живут:', folks_room2)