# -*- coding: utf-8 -*-
# Создать модуль my_burger. В нем определить функции добавления инградиентов:
#  - булочки
#  - котлеты
#  - огурчика
#  - помидорчика
#  - майонеза
#  - сыра
# В каждой функции выводить на консоль что-то вроде "А теперь добавим ..."
def burger_bulochka():
    print("Берем булочку для бургера")
def kotleta():
    print("А теперь добавим котлету")
def ogurchik():
    print("А теперь добавим огурчик")
def pomidorchik():
    print("А теперь добавим помидорчик")
def mayonez():
    print("А теперь добавим моцонез")
def syr():
    print("А теперь добавим сыра")
def ketchup():
    print("А теперь добавим кетчупа")
